alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4400.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>RTC</name>
			<description>Real Time Clock</description>
			<baseAddress>0x50004A00</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0200</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ID</name>
					<description>RTC ID Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00A3C000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTR</name>
					<description>RTC Control Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x7FFF0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENB</name>
							<description>RTC Module Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TAE</name>
							<description>Timer Alarm Enable for Hibernation Wake-up</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ESEC</name>
							<description>Enable Seconds Comparison for Hibernation Wake-up</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EMIC</name>
							<description>Enable Minutes Comparison for Hibernation Wake-up</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EHOC</name>
							<description>Enable Hours Comparison for Hibernation Wake-up</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EDAC</name>
							<description>Enable Days Comparison for Hibernation Wake-up</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EMOC</name>
							<description>Enable Months Comparison for Hibernation Wake-up</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EYEC</name>
							<description>Enable Years Comparison for Hibernation Wake-up</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIV</name>
							<description>RTC Clock Divider Value</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAWSTAT</name>
					<description>RTC Raw Service Request Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RPSE</name>
							<description>Raw Periodic Seconds Service Request</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RPMI</name>
							<description>Raw Periodic Minutes Service Request</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RPHO</name>
							<description>Raw Periodic Hours Service Request</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RPDA</name>
							<description>Raw Periodic Days Service Request</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RPMO</name>
							<description>Raw Periodic Months Service Request</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RPYE</name>
							<description>Raw Periodic Years Service Request</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RAI</name>
							<description>Raw Alarm Service Request</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STSSR</name>
					<description>RTC Service Request Status Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SPSE</name>
							<description>Periodic Seconds Service Request Status after Masking</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPMI</name>
							<description>Periodic Minutes Service Request Status after Masking</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPHO</name>
							<description>Periodic Hours Service Request Status after Masking</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPDA</name>
							<description>Periodic Days Service Request Status after Masking</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPMO</name>
							<description>Periodic Months Service Request Status after Masking</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SPYE</name>
							<description>Periodic Years Service Request Status after Masking</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SAI</name>
							<description>Alarm Service Request Status after Masking</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MSKSR</name>
					<description>RTC Service Request Mask Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MPSE</name>
							<description>Periodic Seconds Interrupt Mask</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MPMI</name>
							<description>Periodic Minutes Interrupt Mask</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MPHO</name>
							<description>Periodic Hours Interrupt Mask</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MPDA</name>
							<description>Periodic Days Interrupt Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MPMO</name>
							<description>Periodic Months Interrupt Mask</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MPYE</name>
							<description>Periodic Years Interrupt Mask</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MAI</name>
							<description>Alarm Interrupt Mask</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CLRSR</name>
					<description>RTC Clear Service Request Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RPSE</name>
							<description>Periodic Seconds Interrupt Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RPMI</name>
							<description>Periodic Minutes Interrupt Clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RPHO</name>
							<description>Periodic Hours Interrupt Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RPDA</name>
							<description>Periodic Days Interrupt Clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RPMO</name>
							<description>Periodic Months Interrupt Clear</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RPYE</name>
							<description>Periodic Years Interrupt Clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RAI</name>
							<description>Alarm Interrupt Clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ATIM0</name>
					<description>RTC Alarm Time Register 0</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ASE</name>
							<description>Alarm Seconds Compare Value</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMI</name>
							<description>Alarm Minutes Compare Value</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AHO</name>
							<description>Alarm Hours Compare Value</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADA</name>
							<description>Alarm Days Compare Value</description>
							<lsb>24</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ATIM1</name>
					<description>RTC Alarm Time Register 1</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>AMO</name>
							<description>Alarm Month Compare Value</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AYE</name>
							<description>Alarm Year Compare Value</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM0</name>
					<description>RTC Time Register 0</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SE</name>
							<description>Seconds Time Value</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MI</name>
							<description>Minutes Time Value</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HO</name>
							<description>Hours Time Value</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DA</name>
							<description>Days Time Value</description>
							<lsb>24</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIM1</name>
					<description>RTC Time Register 1</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DAWE</name>
							<description>Days of Week Time Value</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MO</name>
							<description>Month Time Value</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>YE</name>
							<description>Year Time Value</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
