alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4400.svd
				<register>
					<name>LINE0</name>
					<description>Line Pattern Register 0</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LINE_0</name>
							<description>Output on LINE[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LINE_1</name>
							<description>Output on LINE[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LINE_2</name>
							<description>Output on LINE[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LINE_3</name>
							<description>Output on LINE[x]</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LINE1</name>
					<description>Line Pattern Register 1</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LINE_4</name>
							<description>Output on LINE[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LINE_5</name>
							<description>Output on LINE[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LINE_6</name>
							<description>Output on LINE[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LINE_A</name>
							<description>Output on LINE[x]</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LDCMP0</name>
					<description>LED Compare Register 0</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMP_LD0</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LD1</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LD2</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LD3</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LDCMP1</name>
					<description>LED Compare Register 1</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMP_LD4</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LD5</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LD6</name>
							<description>Compare Value for LED COL[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_LDA_TSCOM</name>
							<description>Compare Value for LED COLA / Common Compare Value for Touch-sense Pad Turns</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCMP0</name>
					<description>Touch-sense Compare Register 0</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMP_TS0</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS1</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS2</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS3</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCMP1</name>
					<description>Touch-sense Compare Register 1</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMP_TS4</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS5</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS6</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CMP_TS7</name>
							<description>Compare Value for Touch-Sense TSIN[x]</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
