alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4400.svd
				<register>
					<name>RX_BROADCAST_FRAMES_GOOD</name>
					<description>Receive Frame Count for Good Broadcast Frames</description>
					<addressOffset>0x018C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXBCASTG</name>
							<description>This field indicates the number of received good broadcast frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_MULTICAST_FRAMES_GOOD</name>
					<description>Receive Frame Count for Good Multicast Frames</description>
					<addressOffset>0x0190</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXMCASTG</name>
							<description>This field indicates the number of received good multicast frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_CRC_ERROR_FRAMES</name>
					<description>Receive Frame Count for CRC Error Frames</description>
					<addressOffset>0x0194</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXCRCERR</name>
							<description>This field indicates the number of frames received with CRC error.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_ALIGNMENT_ERROR_FRAMES</name>
					<description>Receive Frame Count for Alignment Error Frames</description>
					<addressOffset>0x0198</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXALGNERR</name>
							<description>This field indicates the number of frames received with alignment (dribble) error.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_RUNT_ERROR_FRAMES</name>
					<description>Receive Frame Count for Runt Error Frames</description>
					<addressOffset>0x019C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXRUNTERR</name>
							<description>This field indicates the number of frames received with runt error(&lt;64 bytes and CRC error).</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_JABBER_ERROR_FRAMES</name>
					<description>Receive Frame Count for Jabber Error Frames</description>
					<addressOffset>0x01A0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXJABERR</name>
							<description>This field indicates the number of giant frames received with length (including CRC) greater than 1,518 bytes (1,522 bytes for VLAN tagged) and with CRC error. If Jumbo Frame mode is enabled, then frames of length greater than 9,018 bytes (9,022 for VLAN tagged) are considered as giant frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_UNDERSIZE_FRAMES_GOOD</name>
					<description>Receive Frame Count for Undersize Frames</description>
					<addressOffset>0x01A4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXUNDERSZG</name>
							<description>This field indicates the number of frames received with length less than 64 bytes and without errors.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_OVERSIZE_FRAMES_GOOD</name>
					<description>Rx Oversize Frames Good Register</description>
					<addressOffset>0x01A8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXOVERSZG</name>
							<description>This field indicates the number of frames received without errors, with length greater than the maxsize (1,518 or 1,522 for VLAN tagged frames; 2,000 bytes if enabled by setting MAC Configuration.2KPE).</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_64OCTETS_FRAMES_GOOD_BAD</name>
					<description>Receive Frame Count for Good and Bad 64 Byte Frames</description>
					<addressOffset>0x01AC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RX64OCTGB</name>
							<description>This field indicates the number of received good and bad frames with length 64 bytes, exclusive of preamble.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_65TO127OCTETS_FRAMES_GOOD_BAD</name>
					<description>Receive Frame Count for Good and Bad 65 to 127 Bytes Frames</description>
					<addressOffset>0x01B0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RX65_127OCTGB</name>
							<description>This field indicates the number of received good and bad frames received with length between 65 and 127 (inclusive) bytes, exclusive of preamble.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_128TO255OCTETS_FRAMES_GOOD_BAD</name>
					<description>Receive Frame Count for Good and Bad 128 to 255 Bytes Frames</description>
					<addressOffset>0x01B4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RX128_255OCTGB</name>
							<description>This field indicates the number of received good and bad frames with length between 128 and 255 (inclusive) bytes, exclusive of preamble.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_256TO511OCTETS_FRAMES_GOOD_BAD</name>
					<description>Receive Frame Count for Good and Bad 256 to 511 Bytes Frames</description>
					<addressOffset>0x01B8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RX256_511OCTGB</name>
							<description>This field indicates the number of received good and bad frames with length between 256 and 511 (inclusive) bytes, exclusive of preamble.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_512TO1023OCTETS_FRAMES_GOOD_BAD</name>
					<description>Receive Frame Count for Good and Bad 512 to 1,023 Bytes Frames</description>
					<addressOffset>0x01BC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RX512_1023OCTGB</name>
							<description>This field indicates the number of received good and bad frames with length between 512 and 1,023 (inclusive) bytes, exclusive of preamble.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD</name>
					<description>Receive Frame Count for Good and Bad 1,024 to Maxsize Bytes Frames</description>
					<addressOffset>0x01C0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RX1024_MAXOCTGB</name>
							<description>This field indicates the number of received good and bad frames with length between 1,024 and maxsize (inclusive) bytes, exclusive of preamble and retried frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_UNICAST_FRAMES_GOOD</name>
					<description>Receive Frame Count for Good Unicast Frames</description>
					<addressOffset>0x01C4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXUCASTG</name>
							<description>This field indicates the number of received good unicast frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_LENGTH_ERROR_FRAMES</name>
					<description>Receive Frame Count for Length Error Frames</description>
					<addressOffset>0x01C8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXLENERR</name>
							<description>This field indicates the number of frames received with length error (Length type field not equal to frame size) for all frames with valid length field.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_OUT_OF_RANGE_TYPE_FRAMES</name>
					<description>Receive Frame Count for Out of Range Frames</description>
					<addressOffset>0x01CC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXOUTOFRNG</name>
							<description>This field indicates the number of received frames with length field not equal to the valid frame size (greater than 1,500 but less than 1,536).</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_PAUSE_FRAMES</name>
					<description>Receive Frame Count for PAUSE Frames</description>
					<addressOffset>0x01D0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXPAUSEFRM</name>
							<description>This field indicates the number of received good and valid PAUSE frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_FIFO_OVERFLOW_FRAMES</name>
					<description>Receive Frame Count for FIFO Overflow Frames</description>
					<addressOffset>0x01D4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXFIFOOVFL</name>
							<description>This field indicates the number of received frames missed because of FIFO overflow.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_VLAN_FRAMES_GOOD_BAD</name>
					<description>Receive Frame Count for Good and Bad VLAN Frames</description>
					<addressOffset>0x01D8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXVLANFRGB</name>
							<description>This field indicates the number of received good and bad VLAN frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_WATCHDOG_ERROR_FRAMES</name>
					<description>Receive Frame Count for Watchdog Error Frames</description>
					<addressOffset>0x01DC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXWDGERR</name>
							<description>This field indicates the number of frames received with error because of the watchdog timeout error (frames with more than 2,048 bytes data load).</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_RECEIVE_ERROR_FRAMES</name>
					<description>Receive Frame Count for Receive Error Frames</description>
					<addressOffset>0x01E0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXRCVERR</name>
							<description>This field indicates the number of frames received with error because of the watchdog timeout error (frames with more than 2,048 bytes data load).</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_CONTROL_FRAMES_GOOD</name>
					<description>Receive Frame Count for Good Control Frames Frames</description>
					<addressOffset>0x01E4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXCTRLG</name>
							<description>This field indicates the number of frames received with error because of the watchdog timeout error (frames with more than 2,048 bytes data load).</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MMC_IPC_RECEIVE_INTERRUPT_MASK</name>
					<description>MMC Receive Checksum Offload Interrupt Mask Register</description>
					<addressOffset>0x0200</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4GFIM</name>
							<description>MMC Receive IPV4 Good Frame Counter Interrupt Mask</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4HERFIM</name>
							<description>MMC Receive IPV4 Header Error Frame Counter Interrupt Mask</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4NOPAYFIM</name>
							<description>MMC Receive IPV4 No Payload Frame Counter Interrupt Mask</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4FRAGFIM</name>
							<description>MMC Receive IPV4 Fragmented Frame Counter Interrupt Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4UDSBLFIM</name>
							<description>MMC Receive IPV4 UDP Checksum Disabled Frame Counter Interrupt Mask</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6GFIM</name>
							<description>MMC Receive IPV6 Good Frame Counter Interrupt Mask</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6HERFIM</name>
							<description>MMC Receive IPV6 Header Error Frame Counter Interrupt Mask</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6NOPAYFIM</name>
							<description>MMC Receive IPV6 No Payload Frame Counter Interrupt Mask</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUDPGFIM</name>
							<description>MMC Receive UDP Good Frame Counter Interrupt Mask</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUDPERFIM</name>
							<description>MMC Receive UDP Error Frame Counter Interrupt Mask</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXTCPGFIM</name>
							<description>MMC Receive TCP Good Frame Counter Interrupt Mask</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXTCPERFIM</name>
							<description>MMC Receive TCP Error Frame Counter Interrupt Mask</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXICMPGFIM</name>
							<description>MMC Receive ICMP Good Frame Counter Interrupt Mask</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXICMPERFIM</name>
							<description>MMC Receive ICMP Error Frame Counter Interrupt Mask</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4GOIM</name>
							<description>MMC Receive IPV4 Good Octet Counter Interrupt Mask</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4HEROIM</name>
							<description>MMC Receive IPV4 Header Error Octet Counter Interrupt Mask</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4NOPAYOIM</name>
							<description>MMC Receive IPV4 No Payload Octet Counter Interrupt Mask</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4FRAGOIM</name>
							<description>MMC Receive IPV4 Fragmented Octet Counter Interrupt Mask</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV4UDSBLOIM</name>
							<description>MMC Receive IPV4 UDP Checksum Disabled Octet Counter Interrupt Mask</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6GOIM</name>
							<description>MMC Receive IPV6 Good Octet Counter Interrupt Mask</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6HEROIM</name>
							<description>MMC Receive IPV6 Header Error Octet Counter Interrupt Mask</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXIPV6NOPAYOIM</name>
							<description>MMC Receive IPV6 No Payload Octet Counter Interrupt Mask</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUDPGOIM</name>
							<description>MMC Receive UDP Good Octet Counter Interrupt Mask</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXUDPEROIM</name>
							<description>MMC Receive UDP Error Octet Counter Interrupt Mask</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXTCPGOIM</name>
							<description>MMC Receive TCP Good Octet Counter Interrupt Mask</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXTCPEROIM</name>
							<description>MMC Receive TCP Error Octet Counter Interrupt Mask</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXICMPGOIM</name>
							<description>MMC Receive ICMP Good Octet Counter Interrupt Mask</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RXICMPEROIM</name>
							<description>MMC Receive ICMP Error Octet Counter Interrupt Mask</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
