alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4400.svd
				<register>
					<name>GRXSTSP_DEVICEMODE</name>
					<description>Receive Status Read and Pop Register [DEVICEMODE]</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>EPNum</name>
							<description>Endpoint Number</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BCnt</name>
							<description>Byte Count</description>
							<lsb>4</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DPID</name>
							<description>Data PID</description>
							<lsb>15</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DATA0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DATA1</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>DATA2</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>MDATA</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PktSts</name>
							<description>Packet Status</description>
							<lsb>17</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Global OUT NAK (triggers an interrupt)</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>OUT data packet received</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>OUT transfer completed (triggers an interrupt)</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>SETUP transaction completed (triggers an interrupt)</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>SETUP data packet received</description>
									<value>#0110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FN</name>
							<description>Frame Number</description>
							<lsb>21</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GRXSTSP_HOSTMODE</name>
					<description>Receive Status Read and Pop Register [HOSTMODE]</description>
					<alternateRegister>GRXSTSP_DEVICEMODE</alternateRegister>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>ChNum</name>
							<description>Channel Number</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BCnt</name>
							<description>Byte Count</description>
							<lsb>4</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DPID</name>
							<description>Data PID</description>
							<lsb>15</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DATA0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DATA1</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>DATA2</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>MDATA</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PktSts</name>
							<description>Packet Status</description>
							<lsb>17</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>IN data packet received</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>IN transfer completed (triggers an interrupt)</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Data toggle error (triggers an interrupt)</description>
									<value>#0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Channel halted (triggers an interrupt)</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GRXFSIZ</name>
					<description>Receive FIFO Size Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<resetValue>0x0000011A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RxFDep</name>
							<description>RxFIFO Depth</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GNPTXFSIZ_HOSTMODE</name>
					<description>Non-Periodic Transmit FIFO Size Register [HOSTMODE]</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<resetValue>0x0010011A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NPTxFStAddr</name>
							<description>Non-periodic Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NPTxFDep</name>
							<description>Non-periodic TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GNPTXFSIZ_DEVICEMODE</name>
					<description>Non-Periodic Transmit FIFO Size Register [DEVICEMODE]</description>
					<alternateRegister>GNPTXFSIZ_HOSTMODE</alternateRegister>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<resetValue>0x00100000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPTxF0StAddr</name>
							<description>IN Endpoint FIFO0 Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPTxF0Dep</name>
							<description>IN Endpoint TxFIFO 0 Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GNPTXSTS</name>
					<description>Non-Periodic Transmit FIFO/Queue Status Register</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<resetValue>0x00080010</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NPTxFSpcAvail</name>
							<description>Non-periodic TxFIFO Space Avail</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Non-periodic TxFIFO is full</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 word available</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2 words available</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NPTxQSpcAvail</name>
							<description>Non-periodic Transmit Request Queue Space Available</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Non-periodic Transmit Request Queue is full</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 location available</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2 locations available</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NPTxQTop</name>
							<description>Top of the Non-periodic Transmit Request Queue</description>
							<lsb>24</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>IN/OUT token</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Zero-length transmit packet (device IN/host OUT)</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Channel halt command</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GUID</name>
					<description>USB Module Identification Register</description>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<resetValue>0x00AEC000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GDFIFOCFG</name>
					<description>Global DFIFO Software Config Register</description>
					<addressOffset>0x05C</addressOffset>
					<size>32</size>
					<resetValue>0x027A02B2</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GDFIFOCfg</name>
							<description>GDFIFOCfg</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPInfoBaseAddr</name>
							<description>EPInfoBaseAddr</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HPTXFSIZ</name>
					<description>Host Periodic Transmit FIFO Size Register</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<resetValue>0x0100012A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PTxFStAddr</name>
							<description>Host Periodic TxFIFO Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PTxFSize</name>
							<description>Host Periodic TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF1</name>
					<description>Device IN Endpoint Transmit FIFO Size Register</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<resetValue>0x0100012A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF2</name>
					<description>Device IN Endpoint Transmit FIFO Size Register</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<resetValue>0x0100022A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF3</name>
					<description>Device IN Endpoint Transmit FIFO Size Register</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<resetValue>0x0100032A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF4</name>
					<description>Device IN Endpoint Transmit FIFO Size Register</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<resetValue>0x0100042A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF5</name>
					<description>Device IN Endpoint Transmit FIFO Size Register</description>
					<addressOffset>0x114</addressOffset>
					<size>32</size>
					<resetValue>0x0100052A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTXF6</name>
					<description>Device IN Endpoint Transmit FIFO Size Register</description>
					<addressOffset>0x118</addressOffset>
					<size>32</size>
					<resetValue>0x0100062A</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPnTxFStAddr</name>
							<description>IN Endpoint FIFOn Transmit RAM Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPnTxFDep</name>
							<description>IN Endpoint TxFIFO Depth</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HCFG</name>
					<description>Host Configuration Register</description>
					<addressOffset>0x400</addressOffset>
					<size>32</size>
					<resetValue>0x00000200</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FSLSPclkSel</name>
							<description>FS PHY Clock Select</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>PHY clock is running at 48 MHz</description>
									<value>#01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FSLSSupp</name>
							<description>FS-Only Support</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>FS-only, connected device can supports also only FS.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>FS-only, even if the connected device can support HS</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DescDMA</name>
							<description>Enable Scatter/gather DMA in Host mode</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FrListEn</name>
							<description>Frame List Entries</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>8 Entries</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>16 Entries</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>32 Entries</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>64 Entries</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PerSchedEna</name>
							<description>Enable Periodic Scheduling</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HFIR</name>
					<description>Host Frame Interval Register</description>
					<addressOffset>0x404</addressOffset>
					<size>32</size>
					<resetValue>0x0000EA60</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FrInt</name>
							<description>Frame Interval</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HFIRRldCtrl</name>
							<description>Reload Control</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>HFIR cannot be reloaded dynamically</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>HFIR can be dynamically reloaded during runtime</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HFNUM</name>
					<description>Host Frame Number/Frame Time Remaining Register</description>
					<addressOffset>0x408</addressOffset>
					<size>32</size>
					<resetValue>0x00003FFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FrNum</name>
							<description>Frame Number</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FrRem</name>
							<description>Frame Time Remaining</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HPTXSTS</name>
					<description>Host Periodic Transmit FIFO/ Queue Status Register</description>
					<addressOffset>0x410</addressOffset>
					<size>32</size>
					<resetValue>0x00080100</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PTxFSpcAvail</name>
							<description>Periodic Transmit Data FIFO Space Available</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Periodic TxFIFO is full</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 word available</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2 words available</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PTxQSpcAvail</name>
							<description>Periodic Transmit Request Queue Space Available</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Periodic Transmit Request Queue is full</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 location available</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2 locations available</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PTxQTop</name>
							<description>Top of the Periodic Transmit Request Queue</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HAINT</name>
					<description>Host All Channels Interrupt Register</description>
					<addressOffset>0x414</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HAINT</name>
							<description>Channel Interrupts</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
