alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4400.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO1</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015020</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO2</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015040</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO3</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015060</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO4</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015080</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO5</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480150A0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO6</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480150C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO7</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480150E0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO8</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015100</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO9</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015120</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO10</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015140</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO11</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015160</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO12</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015180</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO13</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480151A0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO14</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480151C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO15</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480151E0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO16</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO17</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015220</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO18</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015240</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO19</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015260</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO20</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015280</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO21</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480152A0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO22</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480152C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO23</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480152E0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO24</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO25</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015320</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO26</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015340</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO27</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015360</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO28</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015380</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO29</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480153A0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO30</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480153C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO31</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480153E0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO32</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO33</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015420</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO34</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015440</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO35</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015460</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO36</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015480</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO37</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480154A0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO38</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480154C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO39</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480154E0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO40</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015500</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO41</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015520</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO42</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015540</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO43</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015560</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO44</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015580</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO45</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480155A0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO46</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480155C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO47</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480155E0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO48</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015600</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO49</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015620</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO50</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015640</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO51</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015660</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO52</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015680</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO53</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480156A0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO54</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480156C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO55</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480156E0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO56</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015700</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO57</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015720</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO58</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015740</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO59</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015760</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO60</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x48015780</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO61</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480157A0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO62</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480157C0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CAN_MO0">
			<name>CAN_MO63</name>
			<description>Controller Area Networks</description>
			<groupName>CAN</groupName>
			<baseAddress>0x480157E0</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x20</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>VADC</name>
			<description>Analog to Digital Converter</description>
			<groupName>VADC</groupName>
			<baseAddress>0x40004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>VADC0_C0_0</name>
				<description>Analog to Digital Converter Common Block 0</description>
				<value>14</value>
			</interrupt>
			<interrupt>
				<name>VADC0_C0_1</name>
				<description>Analog to Digital Converter Common Block 0</description>
				<value>15</value>
			</interrupt>
			<interrupt>
				<name>VADC0_C0_2</name>
				<description>Analog to Digital Converter Common Block 0</description>
				<value>16</value>
			</interrupt>
			<interrupt>
				<name>VADC0_C0_3</name>
				<description>Analog to Digital Converter Common Block 0</description>
				<value>17</value>
			</interrupt>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register</description>
					<addressOffset>0x0000</addressOffset>
					<size>32</size>
					<resetValue>0x00000003</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>On request: enable the module clock</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Off request: stop the module clock</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Module clock is enabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Off: module is not clocked</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Sleep mode request is enabled and functional</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Module disregards the sleep mode control signal</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register</description>
					<addressOffset>0x0008</addressOffset>
					<size>32</size>
					<resetValue>0x00C5C000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
