alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4400.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU40_CC41</name>
			<description>Capture Compare Unit 4 - Unit 0</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x4000C200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU40_CC42</name>
			<description>Capture Compare Unit 4 - Unit 0</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x4000C300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU40_CC43</name>
			<description>Capture Compare Unit 4 - Unit 0</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x4000C400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU41_CC40</name>
			<description>Capture Compare Unit 4 - Unit 1</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40010100</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU41_CC41</name>
			<description>Capture Compare Unit 4 - Unit 1</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40010200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU41_CC42</name>
			<description>Capture Compare Unit 4 - Unit 1</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40010300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU41_CC43</name>
			<description>Capture Compare Unit 4 - Unit 1</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40010400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU42_CC40</name>
			<description>Capture Compare Unit 4 - Unit 2</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40014100</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU42_CC41</name>
			<description>Capture Compare Unit 4 - Unit 2</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40014200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU42_CC42</name>
			<description>Capture Compare Unit 4 - Unit 2</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40014300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU42_CC43</name>
			<description>Capture Compare Unit 4 - Unit 2</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x40014400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU43_CC40</name>
			<description>Capture Compare Unit 4 - Unit 3</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x48004100</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU43_CC41</name>
			<description>Capture Compare Unit 4 - Unit 3</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x48004200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU43_CC42</name>
			<description>Capture Compare Unit 4 - Unit 3</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x48004300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU40_CC40">
			<name>CCU43_CC43</name>
			<description>Capture Compare Unit 4 - Unit 3</description>
			<groupName>CCU4</groupName>
			<baseAddress>0x48004400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>CCU80</name>
			<description>Capture Compare Unit 8 - Unit 0</description>
			<groupName>CCU8</groupName>
			<headerStructName>CCU8</headerStructName>
			<baseAddress>0x40020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CCU80_0</name>
				<description>Capture Compare Unit 8 (Module 0)</description>
				<value>60</value>
			</interrupt>
			<interrupt>
				<name>CCU80_1</name>
				<description>Capture Compare Unit 8 (Module 0)</description>
				<value>61</value>
			</interrupt>
			<interrupt>
				<name>CCU80_2</name>
				<description>Capture Compare Unit 8 (Module 0)</description>
				<value>62</value>
			</interrupt>
			<interrupt>
				<name>CCU80_3</name>
				<description>Capture Compare Unit 8 (Module 0)</description>
				<value>63</value>
			</interrupt>
			<registers>
				<register>
					<name>GCTRL</name>
					<description>Global Control Register</description>
					<addressOffset>0x0000</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRBC</name>
							<description>Prescaler Clear Configuration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SW only</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>GSTATThe register contains the status of the prescaler and each timer slice (idle mode or running)..PRB and prescaler registers are cleared when the Run Bit of CC80 is cleared.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>GSTATThe register contains the status of the prescaler and each timer slice (idle mode or running)..PRB and prescaler registers are cleared when the Run Bit of CC81 is cleared.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>GSTATThe register contains the status of the prescaler and each timer slice (idle mode or running)..PRB and prescaler registers are cleared when the Run Bit of CC82 is cleared.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>GSTATThe register contains the status of the prescaler and each timer slice (idle mode or running)..PRB and prescaler registers are cleared when the Run Bit of CC83 is cleared.</description>
									<value>#100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCIS</name>
							<description>Prescaler Input Clock Selection</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Module clock</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU8x.ECLKA</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>CCU8x.ECLKB</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CCU8x.ECLKC</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUSCFG</name>
							<description>Suspend Mode Configuration</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Suspend request ignored. The module never enters in suspend</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Stops all the running slices immediately. Safe stop is not applied.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Stops the block immediately and clamps all the outputs to PASSIVE state. Safe stop is applied.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Waits for the roll over of each slice to stop and clamp the slices outputs. Safe stop is applied.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSE0</name>
							<description>Slice 0 Multi Channel shadow transfer enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer can only be requested by SW</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer can be requested via SW and via the CCU8x.MCSS input.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSE1</name>
							<description>Slice 1 Multi Channel shadow transfer enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer can only be requested by SW</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer can be requested via SW and via the CCU8x.MCSS input.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSE2</name>
							<description>Slice 2 Multi Channel shadow transfer enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer can only be requested by SW</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer can be requested via SW and via the CCU8xMCSS input.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSE3</name>
							<description>Slice 3 Multi Channel shadow transfer enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shadow transfer can only be requested by SW</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer can be requested via SW and via the CCU8x.MCSS input.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSDE</name>
							<description>Multi Channel shadow transfer request configuration</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Only the shadow transfer for period and compare values is requested</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shadow transfer for the compare, period and prescaler compare values is requested</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Shadow transfer for the compare, period, prescaler and dither compare values is requested</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GSTAT</name>
					<description>Global Status Register</description>
					<addressOffset>0x0004</addressOffset>
					<size>32</size>
					<resetValue>0x0000000F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>S0I</name>
							<description>CC80 IDLE status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Running</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Idle</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S1I</name>
							<description>CC81 IDLE status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Running</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Idle</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S2I</name>
							<description>CC82 IDLE status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Running</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Idle</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S3I</name>
							<description>CC83 IDLE status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Running</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Idle</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRB</name>
							<description>Prescaler Run Bit</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Prescaler is stopped</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler is running</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCRB</name>
							<description>Parity Checker Run Bit</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Parity Checker is stopped</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Parity Checker is running</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GIDLS</name>
					<description>Global Idle Set</description>
					<addressOffset>0x0008</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SS0I</name>
							<description>CC80 IDLE mode set</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SS1I</name>
							<description>CC81 IDLE mode set</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SS2I</name>
							<description>CC82 IDLE mode set</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SS3I</name>
							<description>CC83 IDLE mode set</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CPRB</name>
							<description>Prescaler# Run Bit Clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PSIC</name>
							<description>Prescaler clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CPCH</name>
							<description>Parity Checker Run bit clear</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GIDLC</name>
					<description>Global Idle Clear</description>
					<addressOffset>0x000C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CS0I</name>
							<description>CC80 IDLE mode clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CS1I</name>
							<description>CC81 IDLE mode clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CS2I</name>
							<description>CC82 IDLE mode clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CS3I</name>
							<description>CC83 IDLE mode clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SPRB</name>
							<description>Prescaler Run Bit Set</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SPCH</name>
							<description>Parity Checker run bit set</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
