alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4400.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="CCU80_CC80">
			<name>CCU80_CC81</name>
			<description>Capture Compare Unit 8 - Unit 0</description>
			<groupName>CCU8</groupName>
			<baseAddress>0x40020200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU80_CC80">
			<name>CCU80_CC82</name>
			<description>Capture Compare Unit 8 - Unit 0</description>
			<groupName>CCU8</groupName>
			<baseAddress>0x40020300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU80_CC80">
			<name>CCU80_CC83</name>
			<description>Capture Compare Unit 8 - Unit 0</description>
			<groupName>CCU8</groupName>
			<baseAddress>0x40020400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU80_CC80">
			<name>CCU81_CC80</name>
			<description>Capture Compare Unit 8 - Unit 1</description>
			<groupName>CCU8</groupName>
			<baseAddress>0x40024100</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU80_CC80">
			<name>CCU81_CC81</name>
			<description>Capture Compare Unit 8 - Unit 1</description>
			<groupName>CCU8</groupName>
			<baseAddress>0x40024200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU80_CC80">
			<name>CCU81_CC82</name>
			<description>Capture Compare Unit 8 - Unit 1</description>
			<groupName>CCU8</groupName>
			<baseAddress>0x40024300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="CCU80_CC80">
			<name>CCU81_CC83</name>
			<description>Capture Compare Unit 8 - Unit 1</description>
			<groupName>CCU8</groupName>
			<baseAddress>0x40024400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>HRPWM0</name>
			<description>High Resolution PWM Unit</description>
			<groupName>HRPWM</groupName>
			<baseAddress>0x40020900</baseAddress>
			<addressBlock>
				<offset>0x0000</offset>
				<size>0x0100</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>HRPWM_0</name>
				<description>High Resolution Pulse Width Modulation (Module 0)</description>
				<value>72</value>
			</interrupt>
			<interrupt>
				<name>HRPWM_1</name>
				<description>High Resolution Pulse Width Modulation (Module 0)</description>
				<value>73</value>
			</interrupt>
			<interrupt>
				<name>HRPWM_2</name>
				<description>High Resolution Pulse Width Modulation (Module 0)</description>
				<value>74</value>
			</interrupt>
			<interrupt>
				<name>HRPWM_3</name>
				<description>High Resolution Pulse Width Modulation (Module 0)</description>
				<value>75</value>
			</interrupt>
			<registers>
				<register>
					<name>HRBSC</name>
					<description>Bias and suspend configuration</description>
					<addressOffset>0x0000</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SUSCFG</name>
							<description>Suspend configuration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Suspend is ignored.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CSGy and HRCy units are halted.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Comparator outputs, HRPWMx.CyO are clamped to passive level and the CSGy units are halted. High resolution channel outputs, HRPWMx.HROUTy0 and HRPWMx.HROUTy1, are clamped to passive state and the HRCy units are halted.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CSGy units are halted. High resolution channel outputs, HRPWMx.HROUTy0 and HRPWMx.HROUTy1, are clamped to passive state and the HRCy units are halted.</description>
									<value>#011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HRBE</name>
							<description>HRPWM bias enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MIDR</name>
					<description>Module identification register</description>
					<addressOffset>0x0008</addressOffset>
					<size>32</size>
					<resetValue>0x00A9C000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MODR</name>
							<description>Module Revision</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODT</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MODN</name>
							<description>Module Number</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GLBANA</name>
					<description>Global Analog Configuration</description>
					<addressOffset>0x0014</addressOffset>
					<size>32</size>
					<resetValue>0x00004B8C</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SLDLY</name>
							<description>Delay of lock detection</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FUP</name>
							<description>Force chargepump up</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>FDN</name>
							<description>Force chargepump down</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLCP</name>
							<description>HRCs chargepump current selection</description>
							<lsb>6</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLIBLDO</name>
							<description>HRCs LDO bias current</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLIBLF</name>
							<description>HRCs loop filter bias current</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SLVREF</name>
							<description>Reference voltage for chargepump and loop filter</description>
							<lsb>13</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TRIBIAS</name>
							<description>Bias trimming</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GHREN</name>
							<description>Force chargepump down</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Global high resolution generation is enabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Global high resolution generation is disabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CSGCFG</name>
					<description>Global CSG configuration</description>
					<addressOffset>0x0020</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>C0PM</name>
							<description>CSG0 Power Mode</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CSG0 unit is powered OFF</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CSG0 unit is set in Low Speed Mode</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CSG0 unit is set in High Speed Mode</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C1PM</name>
							<description>CSG1 Power Mode</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CSG1 unit is powered OFF</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CSG1 unit is set in Low Speed Mode</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CSG1 unit is set in High Speed Mode</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C2PM</name>
							<description>CSG2 Power Mode</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CSG2 unit is powered OFF</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CSG2 unit is set in Low Speed Mode</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>CSG2 unit is set in High Speed Mode</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C0CD</name>
							<description>CSG0 Clock disable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>C1CD</name>
							<description>CSG1 Clock disable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>C2CD</name>
							<description>CSG2 Clock disable</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CSGSETG</name>
					<description>Global CSG run bit set</description>
					<addressOffset>0x0024</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SD0R</name>
							<description>DAC0 run bit set</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SC0R</name>
							<description>CMP0 run bit set</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SC0P</name>
							<description>CMP0 passive level set</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SD1R</name>
							<description>DAC1 run bit set</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SC1R</name>
							<description>CMP1 run bit set</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SC1P</name>
							<description>CMP1 passive level set</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SD2R</name>
							<description>DAC2 run bit set</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SC2R</name>
							<description>CMP2 run bit set</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SC2P</name>
							<description>CMP2 passive level set</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CSGCLRG</name>
					<description>Global CSG run bit clear</description>
					<addressOffset>0x0028</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CD0R</name>
							<description>DAC0 run bit clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC0R</name>
							<description>CMP0 run bit clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC0P</name>
							<description>CMP0 passive level clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CD1R</name>
							<description>DAC1 run bit clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC1R</name>
							<description>CMP1 run bit clear</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC1P</name>
							<description>CMP1 passive level clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CD2R</name>
							<description>DAC2 run bit clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC2R</name>
							<description>CMP2 run bit clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>CC2P</name>
							<description>CMP2 passive level clear</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CSGSTATG</name>
					<description>Global CSG run bit status</description>
					<addressOffset>0x002C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>D0RB</name>
							<description>DAC0 run bit status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DAC0 is not running (control logic is disabled)</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DAC0 is running</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C0RB</name>
							<description>CMP0 run bit status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CMP0 functionality is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CMP0 functionality is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PSLS0</name>
							<description>CMP0 output passive status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CMP0 output is not clamped</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CMP0 output is clamped</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>D1RB</name>
							<description>DAC1 run bit status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DAC1 is not running (control logic is disabled)</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DAC1 is running</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C1RB</name>
							<description>CMP1 run bit status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CMP1 functionality is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CMP1 functionality is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PSLS1</name>
							<description>CMP1 output passive status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CMP1 output is not clamped</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CMP1 output is clamped</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>D2RB</name>
							<description>DAC2 run bit status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>DAC2 is not running (control logic is disabled)</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DAC1 is running</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C2RB</name>
							<description>CMP2 run bit status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CMP2 functionality is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CMP2 functionality is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PSLS2</name>
							<description>CMP2 output passive status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CMP2 output is not clamped</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CMP2 output is clamped</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CSGFCG</name>
					<description>Global CSG slope/prescaler control</description>
					<addressOffset>0x0030</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>S0STR</name>
							<description>Slope 0 start</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S0STP</name>
							<description>Slope 0 stop</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS0STR</name>
							<description>Prescaler 0 start</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS0STP</name>
							<description>Prescaler 0 stop</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS0CLR</name>
							<description>Prescaler 0 clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1STR</name>
							<description>Slope 1 start</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S1STP</name>
							<description>Slope 1 stop</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1STR</name>
							<description>Prescaler 1 start</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1STP</name>
							<description>Prescaler 1 stop</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1CLR</name>
							<description>Prescaler 1 clear</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2STR</name>
							<description>Slope 2 start</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>S2STP</name>
							<description>Slope 2 stop</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2STR</name>
							<description>Prescaler 2 start</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2STP</name>
							<description>Prescaler 2 stop</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2CLR</name>
							<description>Prescaler 2 clear</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
